# long data 만들기 

-각 변수는 하나의 컬럼에 배치
- 각 관측치는 한행에 1건씩 분리되어 배치 
- 각 값은 개별 셀에 배치

-melt()
-piovt()
-pivot_table(): 집계함수 적용

In [1]:
import pandas as pd

In [5]:
df=pd.read_csv(r'./data/pew.csv')
type(df)

pandas.core.frame.DataFrame

In [6]:
df.head(2)

,religion,<$10k,$10-20k,$20-30k,$30-40k,$40-50k,$50-75k,$75-100k,$100-150k,>150k,Don't know/refused
0,Agnostic,27,34,60,81,76,137,122,109,84,96
1,Atheist,12,27,37,52,35,70,73,59,74,76

In [7]:
pd.melt(df)

               variable               value
0              religion            Agnostic
1              religion             Atheist
2              religion            Buddhist
3              religion            Catholic
4              religion  Don’t know/refused
..                  ...                 ...
193  Don't know/refused                  73
194  Don't know/refused                  18
195  Don't know/refused                  71
196  Don't know/refused                   8
197  Don't know/refused                 597

[198 rows x 2 columns]

In [12]:
df.melt(id_vars='religion').sort_values('religion').head(18)

     religion            variable  value
0    Agnostic               <$10k     27
144  Agnostic               >150k     84
162  Agnostic  Don't know/refused     96
126  Agnostic           $100-150k    109
36   Agnostic             $20-30k     60
108  Agnostic            $75-100k    122
18   Agnostic             $10-20k     34
90   Agnostic             $50-75k    137
72   Agnostic             $40-50k     76
54   Agnostic             $30-40k     81
109   Atheist            $75-100k     73
19    Atheist             $10-20k     27
55    Atheist             $30-40k     52
91    Atheist             $50-75k     70
127   Atheist           $100-150k     59
145   Atheist               >150k     74
73    Atheist             $40-50k     35
37    Atheist             $20-30k     37

In [13]:
df_melt=df.melt(id_vars='religion')
df_melt

                  religion            variable  value
0                 Agnostic               <$10k     27
1                  Atheist               <$10k     12
2                 Buddhist               <$10k     27
3                 Catholic               <$10k    418
4       Don’t know/refused               <$10k     15
..                     ...                 ...    ...
175               Orthodox  Don't know/refused     73
176        Other Christian  Don't know/refused     18
177           Other Faiths  Don't know/refused     71
178  Other World Religions  Don't know/refused      8
179           Unaffiliated  Don't know/refused    597

[180 rows x 3 columns]

In [16]:
cond=df_melt['religion']=='Agnostic'

In [17]:
df_melt.loc[cond]

     religion            variable  value
0    Agnostic               <$10k     27
18   Agnostic             $10-20k     34
36   Agnostic             $20-30k     60
54   Agnostic             $30-40k     81
72   Agnostic             $40-50k     76
90   Agnostic             $50-75k    137
108  Agnostic            $75-100k    122
126  Agnostic           $100-150k    109
144  Agnostic               >150k     84
162  Agnostic  Don't know/refused     96

In [ ]:
df_melt_rename=df_melt.rename(columns={'variable':'income','value':'conunt'})

In [21]:
df_melt_rename

                  religion              income  conunt
0                 Agnostic               <$10k      27
1                  Atheist               <$10k      12
2                 Buddhist               <$10k      27
3                 Catholic               <$10k     418
4       Don’t know/refused               <$10k      15
..                     ...                 ...     ...
175               Orthodox  Don't know/refused      73
176        Other Christian  Don't know/refused      18
177           Other Faiths  Don't know/refused      71
178  Other World Religions  Don't know/refused       8
179           Unaffiliated  Don't know/refused     597

[180 rows x 3 columns]

In [25]:
df1=pd.read_csv(r'./data/billboard.csv')
df1

,year,artist,track,time,date.entered,wk1,wk2,wk3,wk4,wk5,...,wk67,wk68,wk69,wk70,wk71,wk72,wk73,wk74,wk75,wk76
0,2000,2 Pac,Baby Don't Cry (Keep...,4:22,2000-02-26,87,82.0,72.0,77.0,87.0,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,2000,2Ge+her,The Hardest Part Of ...,3:15,2000-09-02,91,87.0,92.0,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,2000,3 Doors Down,Kryptonite,3:53,2000-04-08,81,70.0,68.0,67.0,66.0,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,2000,3 Doors Down,Loser,4:24,2000-10-21,76,76.0,72.0,69.0,67.0,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,2000,504 Boyz,Wobble Wobble,3:35,2000-04-15,57,34.0,25.0,17.0,17.0,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
312,2000,Yankee Grey,Another Nine Minutes,3:10,2000-04-29,86,83.0,77.0,74.0,83.0,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
313,2000,"Yearwood, Trisha",Real Live Woman,3:55,2000-04-01,85,83.0,83.0,82.0,81.0,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
314,2000,Ying Yang Twins,Whistle While You Tw...,4:19,2000-03-18,95,94.0,91.0,85.0,84.0,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
315,2000,Zombie Nation,Kernkraft 400,3:30,2000-09-02,99,99.0,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
316,2000,matchbox twenty,Bent,4:12,2000-04-29,60,37.0,29.0,24.0,22.0,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [33]:
df1_melt=df1.melt(id_vars='artist')
cond1=df1_melt['artist']=='2 Pac'
df1_melt.loc[cond1]
df1_melt_rename=df1_melt.rename(columns={'variable':'Music time','value':'year'})
df1_melt_rename

                 artist Music time  year
0                 2 Pac       year  2000
1               2Ge+her       year  2000
2          3 Doors Down       year  2000
3          3 Doors Down       year  2000
4              504 Boyz       year  2000
...                 ...        ...   ...
25355       Yankee Grey       wk76   NaN
25356  Yearwood, Trisha       wk76   NaN
25357   Ying Yang Twins       wk76   NaN
25358     Zombie Nation       wk76   NaN
25359   matchbox twenty       wk76   NaN

[25360 rows x 3 columns]

# aply

In [36]:
df=pd.DataFrame({
  "a":[10,20,30],
  "b":[20,30,40]
})
df**2

     a     b
0  100   400
1  400   900
2  900  1600

In [ ]:
df/10 #vectorisation

     a    b
0  1.0  2.0
1  2.0  3.0
2  3.0  4.0

In [42]:
def make_sq(x,e=2):
    return x**e

In [43]:
df.apply(make_sq,e=2.71)

              a             b
0    512.861384   3355.763054
1   3355.763054  10069.284236
2  10069.284236  21957.484078

In [45]:
import pandas as pd

# 직원 명단 DataFrame 생성
data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eva'],
    'Age': [25, 45, 35, 32, 28],
    'Salary': [5000, 7000, 6500, 5500, 6000]
}
sal_df=pd.DataFrame(data)
sal_df

      Name  Age  Salary
0    Alice   25    5000
1      Bob   45    7000
2  Charlie   35    6500
3    David   32    5500
4      Eva   28    6000

In [56]:
def age_category(age):
  if age<30:
     return '20대'
  elif age<40 :
    return '30대'
  else:
    return '40대'

In [57]:
sal_df['Age_category']=sal_df['Age'].apply(age_category)
sal_df

      Name  Age  Salary Age_category   Bonus
0    Alice   25    5000          20대  1000.0
1      Bob   45    7000          40대  1400.0
2  Charlie   35    6500          30대  1300.0
3    David   32    5500          30대  1100.0
4      Eva   28    6000          20대  1200.0

In [53]:
# 보우너스
sal_df['Bonus'] = sal_df['Salary'] * 0.2

In [55]:
sal_df

      Name  Age  Salary Age_category   Bonus
0    Alice   25    5000          20대  1000.0
1      Bob   45    7000          영포티  1400.0
2  Charlie   35    6500          30대  1300.0
3    David   32    5500          30대  1100.0
4      Eva   28    6000          20대  1200.0

# 데이터 병합

In [ ]:
df